{
  "category": "Defines the group label under which this package will appear in the documentation sidebar. Use this to organize related packages (e.g., \"Core Tools\", \"Integrations\") together in the generated website.",
  "description": "A brief summary of the package's purpose. This text is displayed in package listings, search results, and the website's navigation menus.",
  "enabled": "Controls whether documentation generation and aggregation is active for this package. Set to `false` to temporarily exclude a package from the build process without deleting its configuration.",
  "logos": "A list of additional logo file paths (absolute or relative with `~` expansion) to copy to the output directory during aggregation. Use this to ensure assets referenced in your documentation or READMEs are available in the website build.",
  "readme": "Configuration for automatically synchronizing the project's README.md with generated documentation. This ensures your source repository's README stays up-to-date with your formal documentation.",
  "readme.base_url": "The absolute base URL used to rewrite root-relative paths (starting with `/`) in the generated README. Essential for ensuring links and image references work correctly when rendered on platforms like GitHub.",
  "readme.generate_toc": "If true, generates and injects a Table of Contents into the README at the `\u003c!-- DOCGEN:TOC:START --\u003e` marker. Useful for long READMEs to improve navigation.",
  "readme.logo": "Configuration settings for generating a combined logo-plus-text SVG header for the README. This allows you to create consistent branding assets directly from your documentation build.",
  "readme.logo.color": "The hex color code for the text in the generated logo. If omitted, the generator attempts to auto-detect a dominant color from the input SVG.",
  "readme.logo.font": "Path to the TrueType (TTF) or OpenType (OTF) font file used to render the text. This is required to convert text to SVG paths, ensuring consistent rendering without client-side font dependencies.",
  "readme.logo.input": "Path to the source logo SVG file. Can be an absolute path or relative to the package root.",
  "readme.logo.output": "The destination path for the generated combined logo SVG. Typically saved within the `docs/images` directory.",
  "readme.logo.spacing": "The vertical space (in pixels) between the logo icon and the text below it. Adjust this to fine-tune the visual balance of the generated header.",
  "readme.logo.text": "The text string to display below the logo icon, usually the project or tool name.",
  "readme.logo.text_scale": "A multiplier to adjust the width of the text relative to the logo width. Defaults to 1.1; adjust if the text appears too wide or too narrow compared to the icon.",
  "readme.logo.width": "The final width (in pixels) of the generated SVG. The height is calculated automatically to maintain the aspect ratio.",
  "readme.output": "The file path where the synchronized README content will be written, typically `README.md` at the project root.",
  "readme.source_section": "The `name` of the documentation section defined in `sections` to use as the main body of the README. This allows you to write your overview once and publish it to both the website and the repository root.",
  "readme.strip_lines": "The number of lines to remove from the beginning of the source section before injecting it into the template. Useful for removing titles or frontmatter that are already handled by the README template.",
  "readme.template": "Path to the Markdown template file (e.g., `docs/README.md.tpl`) containing static content and injection markers (e.g., `\u003c!-- DOCGEN:OVERVIEW:START --\u003e`).",
  "sections": "A list of distinct documentation units to generate. Each section represents a specific file or output (e.g., an overview, a CLI reference, or a configuration guide).",
  "sections.agg_strip_lines": "The number of lines to strip from the top of the generated markdown file during the aggregation phase (website build). Useful for removing H1 titles that conflict with website layouts.",
  "sections.binary": "For `capture` type sections, specifies the name or path of the binary executable to run (e.g., `grove`). The tool must be available in the system PATH.",
  "sections.depth": "For `capture` type sections, limits the recursion depth when traversing CLI subcommands. Defaults to 5.",
  "sections.descriptions": "Path to a JSON file containing LLM-generated property descriptions. Used by `schema_table` sections to populate the description column with richer content than the raw schema provides.",
  "sections.doc_sources": "For `doc_sections` type, defines a list of source references to aggregate. Each source points to a specific package and document to pull content from.",
  "sections.doc_sources.description": "A contextual description of what this specific configuration source represents. Used to generate introductory text for the aggregated section.",
  "sections.doc_sources.doc": "The filename of the documentation within the target package to read. If omitted, the tool attempts to auto-discover the main schema documentation.",
  "sections.doc_sources.package": "The name of the package containing the source documentation. This package must exist within one of the configured ecosystems.",
  "sections.doc_sources.properties": "A list of specific property paths (in dot notation) to include in the generated documentation. Allows for selective documentation of configuration subsets.",
  "sections.doc_sources.title": "The H2 heading title to use for this source's content in the generated output.",
  "sections.examples": "Path to a JSON file containing LLM-generated usage examples. Used by `schema_table` sections (json format) to enrich the structured data output.",
  "sections.examples_format": "Specifies the format of the examples in the output. Options are `toml` (default) or `yaml`.",
  "sections.format": "Controls the output format for specific section types. For `capture`, `styled` includes HTML colors while `plain` is markdown code blocks. For `schema_table`, `json` outputs structured data instead of a markdown table.",
  "sections.json_key": "Overrides the key used for this section in the `structured_output_file`. If not set, the section `name` is used.",
  "sections.max_output_tokens": "Limits the length of the LLM's response for this specific section. Increase this for long, detailed documentation tasks.",
  "sections.model": "Overrides the global LLM model setting for this specific section. Useful for using a more capable model for complex sections like schema analysis.",
  "sections.name": "A unique identifier for the section. Used for internal referencing and as the default key in structured JSON output.",
  "sections.order": "A numeric value determining the sequence of this section relative to others in the final output or navigation.",
  "sections.output": "The filename for the generated output (e.g., `01-overview.md`). Relative to the `docs` directory or the section's `output_dir`.",
  "sections.output_dir": "Overrides the default output directory for this specific section. Useful in `sections` mode to organize content into subdirectories.",
  "sections.prompt": "Path to the prompt file (relative to `docs/prompts` or notebook prompts dir) containing instructions for the LLM.",
  "sections.rules_file": "Path to a specific `.gitignore`-style rules file for this section. Used to build a tailored context for the LLM.",
  "sections.schemas": "For `schema_*` types, a list of input schemas to process. Allows aggregating multiple schema files into a single documentation page.",
  "sections.schemas.path": "Path to the JSON schema file relative to the package root.",
  "sections.schemas.title": "An optional title for the schema section. If provided, creates a heading before the schema's documentation.",
  "sections.source": "The source identifier for the generator. For `nb_concept` type, this is the Concept ID (e.g. `my-concept`). Legacy usage: path to a single schema file.",
  "sections.status": "The publication status of this section (`draft`, `dev`, `production`). Controls visibility in different build modes (e.g., drafts are excluded from production builds).",
  "sections.subcommand_order": "For `capture` type, a list of subcommand names to prioritize in the output order. Unlisted commands appear alphabetically after these.",
  "sections.temperature": "Controls the randomness of the LLM output (0.0 to 1.0) for this section. Lower values are more deterministic; higher values are more creative.",
  "sections.title": "The human-readable title of the section, used in navigation and page headings.",
  "sections.toml_section": "For `schema_examples` with TOML format, specifies a table header (e.g., `[nav]`) to wrap the generated examples in.",
  "sections.top_k": "The top-k sampling parameter for the LLM generation for this section.",
  "sections.top_p": "The nucleus sampling (top-p) parameter for the LLM generation for this section.",
  "sections.type": "Specifies the generator logic to use. Common types include `schema_to_md` (LLM docs), `schema_table` (deterministic reference), `capture` (CLI help), and `doc_sections` (aggregation).",
  "settings": "Global configuration settings that apply to the entire documentation generation process for this package.",
  "settings.ecosystems": "A list of ecosystem names to search when resolving cross-package references or aggregating content. Defaults to the current ecosystem if empty.",
  "settings.max_output_tokens": "The global default limit for LLM response length. Can be overridden per section.",
  "settings.model": "The default LLM model to use for all sections (e.g., `gemini-1.5-pro`). Can be overridden per section.",
  "settings.output_dir": "The directory where generated documentation files are saved. Defaults to `docs`.",
  "settings.output_mode": "Determines how the package is treated during aggregation. `package` (default) treats it as a standalone doc unit; `sections` treats it as a collection of website content sections (e.g., overview, concepts).",
  "settings.regeneration_mode": "Controls how existing files affect generation. `scratch` generates fresh; `reference` injects the existing file into the prompt, asking the LLM to update it while preserving manual edits.",
  "settings.rules_file": "The default rules file used to gather code context for LLM prompts. Defaults to `docs/docs.rules` if not specified.",
  "settings.structured_output_file": "If set, generates a single JSON file containing the parsed content of all Markdown sections. Useful for feeding documentation into other tools or search indexes.",
  "settings.system_prompt": "Path to a custom system prompt file, or `default` to use the built-in technical writing guidelines. Sets the baseline persona and constraints for the LLM.",
  "settings.temperature": "The global default temperature (randomness) setting for LLM generation.",
  "settings.toc_depth": "The maximum heading level to include in the generated Table of Contents for the website sidebar or manifest. Defaults to 3.",
  "settings.top_k": "The global default top-k sampling parameter.",
  "settings.top_p": "The global default nucleus sampling (top-p) parameter.",
  "sidebar": "Configuration for the website sidebar structure. Primarily used in the root `grove-website` configuration to define the global navigation.",
  "sidebar.categories": "Defines the specific display settings (icon, grouping) for sidebar categories.",
  "sidebar.categories.flat": "If true, lists items in this category directly without a collapsible parent folder.",
  "sidebar.categories.icon": "The Nerd Font icon name to display next to the category label.",
  "sidebar.categories.packages": "An explicit list of package names defining the order they should appear within this category.",
  "sidebar.category_order": "An array defining the display order of top-level categories in the sidebar.",
  "sidebar.package_category_override": "A map allowing you to move specific packages into different categories than defined in their own `docgen.config.yml`.",
  "sidebar.packages": "Configuration for customizing the appearance of specific packages in the sidebar.",
  "sidebar.packages.color": "A color name (e.g., `green`, `blue`) used for the package's status indicator or icon accent.",
  "sidebar.packages.icon": "The Nerd Font icon name to display for this specific package.",
  "sidebar.packages.status": "Overrides the publication status for the package in the sidebar (e.g., `beta`, `deprecated`).",
  "title": "The display name of the package. This is used as the top-level heading in the documentation sidebar and website."
}